// Task 24
// Напишите программу, которая принимает на ввод число и выдает сумму чисел до этого числа


Console.Clear();
Console.Write("Введите число: ");
double n = Convert.ToInt32(Console.ReadLine());
Console.WriteLine($"Результат: {(1 + n) / 2 * n}");